import 'base_model.dart';

class VideoModel extends BaseModel {
  VideoModel({
    required this.name,
    required this.title,
    required this.lyric,
    required this.maxPage,
  });

  final String name;

  final String title;

  final Iterable<Iterable<String>> lyric;

  final int maxPage;

  static final VideoModel _empty = VideoModel(
    name: '',
    title: '',
    lyric: const [],
    maxPage: 0,
  );

  factory VideoModel.empty() => _empty;

  @override
  bool get isEmpty => this == _empty;

  String get lyricString => lyric
      .toList()
      .asMap()
      .entries
      .map((x) => '${x.key + 1}. ${x.value.join('\n')}')
      .join('\n\n');

  @override
  List<Object?> get props => [name, title, lyric, maxPage];

  @override
  String toString() =>
      'assets: $name title: $title lyric: $lyric maxPage: $maxPage';

  VideoModel copyWith({
    String? assets,
    String? title,
    Iterable<Iterable<String>>? lyric,
    int? maxLine,
  }) {
    return new VideoModel(
      name: assets ?? this.name,
      title: title ?? this.title,
      lyric: lyric ?? this.lyric,
      maxPage: this.maxPage,
    );
  }

  static Iterable<VideoModel> values() => [
        VideoModel.H27(),
        VideoModel.H28(),
        VideoModel.H36(),
        VideoModel.H40(),
        VideoModel.H46(),
        VideoModel.H78(),
        VideoModel.H85(),
        VideoModel.H91(),
        VideoModel.H93(),
        VideoModel.H102(),
        VideoModel.H112(),
        VideoModel.H135(),
        VideoModel.H138(),
        VideoModel.H147(),
        VideoModel.H150(),
        VideoModel.H151(),
        VideoModel.H158(),
        VideoModel.H168(),
        VideoModel.H179(),
        VideoModel.H183(),
        VideoModel.H184(),
        VideoModel.H185(),
        VideoModel.H499(),
      ];

  factory VideoModel.H27() => VideoModel(
        name: 'T27',
        title: '27. พระพักตร์พระเจ้าผุดผ่องเเวววาม',
        lyric: [
          [
            //verse 1
            'พระพักตร์พระเจ้าผุดผ่องเเวววามดูงามเลิศ',
            'ต้องนัยน์ตาพระเศียรทรงสวมมงกุฎโสภาพระ',
            'โอษฐ์ตรัสคํารุณย์พระโอษฐ์ตรัสคําการุณย์',
          ],
          [
            //verse 2
            'ทั่วโลกแหล่งหล้าหาเปรียบฤๅมีมนุษย์เม',
            'ธีไม่ปานทั่วฟ้าสวรรค์และจักรวาลภู',
            'บาลทรงศักดิ์ยิ่งใหญ่ภูบาลทรงศักดิ์ยิ่งใหญ่',
          ],
          [
            //verse 3
            'ตัวข้าเป็นหนี้พระองค์มากมายชีวิตจิต',
            'ใจและกายความตายพระองค์ทรงให้มีชัยรอด',
            'จากหลุมมรณารอดจากหลุมมรณา',
          ],
          [
            //verse 4
            'ข้าวางใจว่าพระองค์ทรงนําให้ข้าถึง',
            'แดนแมนสรวงยามข้าเข้าเฝ้าแนบชิดพระทรวงดวง',
            'จิตของข้าเบิกบานดวงจิตของข้าเบิกบาน',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H28() => VideoModel(
        name: 'T28',
        title: '28. ขอพระพรจากเบื้องบน',
        lyric: [
          [
            //verse 1
            'ขอพระพรจากเบื้องบนลงมา',
            'ให้ใจข้าล้นเหมือนลําธาร',
            'ของทุกสิ่งที่ข้าได้มีอยู่',
            'ล้วนพระองค์เป็นผู้ประทาน',
            'โมทนาพระคุณพระเยซู',
            'ด้วยขับร้องบทเพลงถวาย',
            'ข้ายืนอยู่บนศิลามั่นคง',
            'คือพระองค์ผู้รักมากมาย',
          ],
          [
            //verse 2
            'ในอดีตทรงช่วยให้มีชัย',
            'เดี่ยวนี้ข้าจึงพึ่งอาศัย',
            'ขอทรงเมตตาข้าเสมอไป',
            'ทั้งทรงช่วยจนถึงวันตาย',
            'พระเยซูทรงติดตามหาข้า',
            'เมื่อหลงไปจากทางสวรรค์',
            'พระองค์ทรงเป็นความรักยิ่งใหญ่',
            'ไถ่ด้วยโลหิตอัศจรรย์',
          ],
          [
            //verse 3
            'ข้าเป็นหนี้พระคุณพระเยซู',
            'เพราะทรงพลีชีวิตเพื่อไถ่',
            'ขอให้ความดีของพระองค์นี้',
            'ตรึงดวงใจข้าจนวันตาย',
            'พระองค์ทรงรักเสมอไปแต่',
            'ข้าเผลอมักลืมพระคุณ',
            'ตั้งแต่นี้ไปขอถวายตัว',
            'กับพระองค์จนชีพวางวาย',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H36() => VideoModel(
        name: 'T36',
        title: '36. สาธุนามฤทธิ์พระเยซูคริสต์',
        lyric: [
          [
            //verse 1
            'สาธุนามฤทธิ์พระเยซูคริสต์',
            'ให้ทูตสวรรค์กราบลง',
            'อัญเชิญให้ทรงมงกุฎพระองค์',
            'พระผู้เป็นเจ้าโลกา',
            'อัญเชิญให้ทรงมงกุฎพระองค์',
            'พระผู้เป็นเจ้าโลกา',
          ],
          [
            //verse 2
            'ให้ชนทุกชาติทุกวัยกราบไหว้',
            'พระผู้ไถ่รอดชีวา',
            'สรรเสริญถวายมงกุฎโสภา',
            'เชิญมาเป็นเจ้าชีวา',
            'สรรเสริญถวายมงกุฎโสภา',
            'เชิญมาเป็นเจ้าชีวา',
          ],
          [
            //verse 3
            'ชาวชนใจบาปชิมรู้ความรัก',
            'จึงลืมพระคุณไม่ได้',
            'ของเลิศประเสริฐถวายเต็มใจ',
            'เชิญทรงมงกุฎเป็นใหญ่',
            'ของเลิศประเสริฐถวายเต็มใจ',
            'เชิญทรงมงกุฎเป็นใหญ่',
          ],
          [
            //verse 4
            'ให้ชนทุกชาติทุกภาษารู้',
            'พระองค์ทรงวายพระชนม์',
            'พระองค์ทรงมงกุฎผ่องใสนั้น',
            'ครอบครองทั่วทุกตําบล',
            'พระองค์ทรงมงกุฎผ่องใสนั้น',
            'ครอบครองทั่วทุกตําบล',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H40() => VideoModel(
        name: 'T40',
        title: '40. พระเจ้ายิ่งใหญ่',
        lyric: [
          [
            //verse 1
            'พระองค์เจ้าข้า ข้าเฝ้ามองดูด้วยยําเกรง',
            'เพราะพระองค์เองเป็นผู้สร้างจักรวาล',
            'เมื่อมองดูดาว เมื่อคราวยินเสียงฟ้าคําราม',
            'เห็นฝีพระหัตถ์ของพระองค์บนท้องฟ้า',
            'จิตข้าสรรเสริญพระ เจ้าองค์พระผู้ช่วย',
            'พระเจ้ายิ่งใหญ่ พระเจ้ายิ่งใหญ่',
            'จิตข้าสรรเสริญพระเจ้าองค์พระผู้ช่วย',
            'พระเจ้ายิ่งใหญ่ พระเจ้ายิ่งใหญ่',
          ],
          [
            //verse 2
            'เมื่อข้าคิดถึงพระเจ้าผู้ไม่ทรงเสียดาย',
            'พระบุตรองค์เดียวเสด็จมาเป็นผู้ไถ่',
            'ถูกทรมานตรึงไว้บนกางเขนเพื่อข้า',
            'ข้าขอบพระคุณที่พระองค์ทรงเมตตา',
            'จิตข้าสรรเสริญพระเจ้าองค์พระผู้ช่วย',
            'พระเจ้ายิ่งใหญ่ พระเจ้ายิ่งใหญ่',
            'จิตข้าสรรเสริญพระเจ้าองค์พระผู้ช่วย',
            'พระเจ้ายิ่งใหญ่ พระเจ้ายิ่งใหญ่',
          ],
          [
            //verse 3
            'พระคริสต์กลับมาด้วยเสียงแตรดังก้องเวหา',
            'เพื่อมารับข้ากลับไปอยู่ในเมืองฟ้า',
            'ข้าจะกราบลงที่พระบาทาด้วยถ่อมใจ',
            'และสรรเสริญว่าพระเจ้าของข้ายิ่งใหญ่',
            'จิตข้าสรรเสริญพระเจ้าองค์พระผู้ช่วย',
            'พระเจ้ายิ่งใหญ่ พระเจ้ายิ่งใหญ่',
            'จิตข้าสรรเสริญพระเจ้าองค์พระผู้ช่วย',
            'พระเจ้ายิ่งใหญ่ พระเจ้ายิ่งใหญ่',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H46() => VideoModel(
    name: 'T46',
    title: '46. สรรเสริญ สรรเสริญ',
    lyric: [
      [
        //verse 1
        'สรรเสริญ สรรเสริญ พระเยซูเป็นผู้ไถ่ดีเลิศ',
        'ชาวชนโห่ร้อง ขอบพระคุณองค์พระบุตร',
        'ทูตสวรรค์ร้อง พร้อมกันสรรเสริญยกย่องชูเชิด',
        'เราถวายเกียรติ แด่องค์ผู้บริสุทธิ์',
        'พระองค์ทรงเป็นผู้เลี้ยงอันดีที่นําทาง',
        'คนอ่อนแอทรงช่วยประคองไว้ไม่วาง',
        'สรรเสริญ สรรเสริญ ประกาศพระคุณของพระเยซู',
        'สรรเสริญ สรรเสริญ ด้วยบทเพลงสดุดี',
      ],
      [
        //verse 2
        'สรรเสริญ สรรเสริญ พระเยซูเป็นผู้ไถ่ดีเลิศ',
        'พระองค์วายชนม์ เพื่อให้ข้าฯพ้นอบาย',
        'ทรงเป็นความรอด เป็นความหวังมั่นคงดังศิลา',
        'จงถวายเกียรติ แด่ผู้ทรงถูกตรึงตาย',
        'เปล่งเสียงยกย่อง ผู้แบกภาระของเราไป',
        'นี่คือความรัก อัศจรรย์อันยิ่งใหญ่',
        'สรรเสริญ สรรเสริญ ประกาศพระคุณของพระเยซู',
        'สรรเสริญ สรรเสริญ ด้วยบทเพลงสดุดี',
      ],
      [
        //verse 3
        'สรรเสริญ สรรเสริญ พระเยซูเป็นผู้ไถ่ดีเลิศ',
        'ร้องโฮซันนา ก้องสนั่นทั่วท้องฟ้า',
        'องค์พระเยซูทรงฤทธิ์ครอบครองเป็นนิจสืบไป',
        'ราชาทั้งหลายนํามงกุฎมาถวาย',
        'พระเยซูทรงครอบครองโลกอย่างผู้มีชัย',
        'ทรงมีอํานาจ ประกอบด้วยฤทธิ์ยิ่งใหญ่',
        'สรรเสริญ สรรเสริญ ประกาศพระคุณของพระเยซู',
        'สรรเสริญ สรรเสริญ ด้วยบทเพลงสดุดี',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H78() => VideoModel(
    name: 'T78',
    title: '78. โลกนี้พระเจ้าประทาน',
    lyric: [
      [
        //verse 1
        'โลกนี้พระเจ้าประทาน',
        'เป็นบ้านอาศัยชั่วคราว',
        'เมื่อถึงเวลาคราต้องจากไป',
        'ใครใครไม่พ้นความตาย',
        'โลกนี้เราอยู่ไม่นาน',
        'สวรรค์คือบ้านของเรา',
        'และที่นั่นเราไม่ต้องพรากจากกัน',
        'เราอยู่สวรรค์นิรันดร์',
      ],
      [
        //verse 2
        'โลกนี้เป็นที่สวยงาม',
        'พระเจ้าทรงสร้างเพื่อเรา',
        'คนโง่เขลาลืมว่าเขาต้องตาย',
        'จึงหลงงมงายหลายปี',
        'วันนี้เชิญท่านทั้งหลาย',
        'กลับใจเชื่อพระเยซู',
        'พระองค์ทรงยอมตายบนไม้กางเขน',
        'เพื่อล้างบาปเวรของเรา',
      ],
      [
        //verse 3
        'โลกนี้ล้วนอนิจจัง',
        'ไม่ยั่งไม่ยืนเสมอ',
        'หลายคนละเมอว่าของจีรัง',
        'แต่ท่านจะหวังอะไร',
        'ความรักพระเจ้าแน่นอน',
        'ไม่สั่นไม่คลอนปรวนแปร',
        'ถ้าเราไว้ใจในองค์พระเยซู',
        'จิตใจเราสุขสบาย',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H85() => VideoModel(
    name: 'T85',
    title: '85. เมื่อข้าคิดถึงองค์พระเยซ',
    lyric: [
      [
        //verse 1
        'เมื่อข้าคิดถึงองค์พระเยซู',
        'เกิดมีความสุขชื่นใจ',
        'ซึ่งเป็นความสุขที่ใครไม่รู้',
        'เมื่อเห็นพระองค์อยู่ใกล้',
      ],
      [
        //verse 2
        'พระนามพระเยซูเลิศประเสริฐ',
        'ไม่มีนามอื่นเทียบได้',
        'ยศศักดิ์พระองค์รุ่งเรืองลํ้าเลิศ',
        'ทรงช่วยมนุษย์ทั้งหลาย',
      ],
      [
        //verse 3
        'ทรงเป็นที่พึ่งของคนถ่อมใจ',
        'ข้าจึงปีติยินดี',
        'ถ้าข้าสะดุดล้มลงเมื่อใด',
        'พระองค์เมตตาปรานี',
      ],
      [
        //verse 4
        'ครั้นเมื่อข้าเชื่อองค์พระเยซู',
        'ก็ได้ความรักอิ่มใจ',
        'นอกจากเหล่าศิษย์ไม่มีใครรู้',
        'ความรักพระเจ้ายิ่งใหญ่',
      ],
      [
        //verse 5
        'ข้ายินดีรักพระองค์สุดใจ',
        'เพราะทรงรักข้าแต่ก่อน',
        'ทรงเป็นสง่าราศีสืบไป',
        'ตลอดกาลนิรันดร',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H91() => VideoModel(
    name: 'T91',
    title: '91. นามประเสริฐเเสนดีเลิศ',
    lyric: [
      [
        //verse 1
        'ผู้ที่มีความทุกข์ลําบากอยู่',
        'จงวางใจในพระเยซู',
        'ผู้เอ็นดูทรงดับความทุกข์นั้น',
        'ทรงอยู่ด้วยกับเราทุกวัน',
        'นามประเสริฐแสนดีเลิศ',
        'ชาวสวรรค์ชาวโลกชื่นใจ',
        'นามประเสริฐแสนดีเลิศ',
        'ซึ่งชาวฟ้าชาวโลกไว้ใจ',
      ],
      [
        //verse 2
        'เมื่อเผชิญกับมารอยู่รอบด้าน',
        'ต่อสู้ด้วยการอธิษฐาน',
        'เมื่อไว้ใจพระนามพระเยซู',
        'ก็มีชัยในการต่อสู้',
        'นามประเสริฐแสนดีเลิศ',
        'ชาวสวรรค์ชาวโลกชื่นใจ',
        'นามประเสริฐแสนดีเลิศ',
        'ซึ่งชาวฟ้าชาวโลกไว้ใจ',
      ],
      [
        //verse 3
        'เมื่อพระองค์ทรงจูงไม่เหินห่าง',
        'ข้าจึงร้องสรรเสริญไม่สร่าง',
        'ข้าก้มลงกราบที่พระบาทไท้',
        'เทิดพระเกียรติด้วยความชื่นใจ',
        'นามประเสริฐแสนดีเลิศ',
        'ชาวสวรรค์ชาวโลกชื่นใจ',
        'นามประเสริฐแสนดีเลิศ',
        'ซึ่งชาวฟ้าชาวโลกไว้ใจ',
      ],
      [
        //verse 4
        'พระองค์ผู้ทรงนามพระเยซู',
        'ข้าขอยกพระนามเชิดชู',
        'เทิดไว้เหนือนามอื่นทั่วพื้นดิน',
        'เพราะพระคริสต์ทรงฤทธิ์ทั้งสิ้น',
        'นามประเสริฐแสนดีเลิศ',
        'ชาวสวรรค์ชาวโลกชื่นใจ',
        'นามประเสริฐแสนดีเลิศ',
        'ซึ่งชาวฟ้าชาวโลกไว้ใจ',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H93() => VideoModel(
    name: 'T93',
    title: '93. พระเยซูเป็นร่มเย็นของข้า',
    lyric: [
      [
        //verse 1
        'พระเยซูเป็นร่มเย็นของข้า',
        'เป็นสุขชีวาพร้อมสรรพ์',
        'พระองค์เป็นแรงทุกวันทุกแห่ง',
        'ถ้าไม่ช่วยข้าคงล้ม',
        'เมื่อข้าโศกเศร้าเข้าเฝ้าพระองค์',
        'ไม่มีผู้ใดช่วยได้แน่นอน',
        'เมื่อข้าเป็นทุกข์ทรงทําให้สุข',
        'ทรงเป็นเพื่อน',
      ],
      [
        //verse 2
        'พระเยซูเป็นร่มเย็นของข้า',
        'เมื่อมารบีฑาขัดขวาง',
        'พระองค์อวยพรไม่หย่อนไม่จาง',
        'ไม่ได้เริศร้างห่างข้า',
        'ประทานแดดฝนมีจนเท่ากัน',
        'ทั้งไร่และนาเรือนเหย้าอนันต์',
        'แดดฝนไร่นาเรือนเหย้าอนันต์',
        'ทรงเป็นเพื่อน',
      ],
      [
        //verse 3
        'พระเยซูเป็นร่มเย็นของข้า',
        'ข้ารักบูชาจริงใจ',
        'โอข้าจะลืมพระองค์อย่างไร',
        'ทรงเป็นสหายซื่อตรง',
        'เชื่อถือพระองค์ข้าคงทําถูก',
        'คุ้มครองรักษาเวลาสุขทุกข์',
        'เดินตามพระองค์คํ่าคืนไม่หลง',
        'ทรงเป็นเพื่อน',
      ],
      [
        //verse 4
        'พระเยซูเป็นร่มเย็นของข้า',
        'จะหาเพื่อนใดไม่เหมือน',
        'ข้าเชื่อวางใจพระองค์เดี๋ยวนี้',
        'ตลอดชีวิตจนตาย',
        'พระองค์ประทานชีวิตนิรันดร์',
        'ชีวิตสําราญเบิกบานบ่จาง',
        'ชีวิตนิรันดร์เบิกบานบ่จาง',
        'ทรงเป็นเพื่อน',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H102() => VideoModel(
    name: 'T102',
    title: '102. ข้าต้องการพระเยซู',
    lyric: [
      [
        //verse 1
        'ข้าต้องการพระเยซู',
        'ยิ่งกว่าเพชรนิลจินดา',
        'อยากเป็นศิษย์พระองค์',
        'ยิ่งกว่าเศรษฐีเงินตรา',
        'ข้าต้องการพระเยซู',
        'ยิ่งกว่าบ้านเรือนไร่นา',
        'อยากให้พระเยซูนําทางชีวา',
        'พระเยซูเป็นยอดปรารถนาของข้า',
        'ทรงช่วยพ้นบาปทุกเวลา',
        'ข้าต้องการพระเยซูยิ่งกว่าเป็นราชา',
        'ซึ่งโลกนี้มีให้ข้า',
      ],
      [
        //verse 2
        'ข้าต้องการพระเยซู',
        'ยิ่งกว่าเกียรติแห่งโลกา',
        'ข้าจงรักภักดี',
        'ต่อพระองค์ผู้รักข้า',
        'ข้าต้องการพระเยซู',
        'ยิ่งกว่าชื่อเสียงเลิศฟ้า',
        'จะรักเเละสัตย์ซื่อต่อพระบุตรา',
        'พระเยซูเป็นยอดปรารถนาของข้า',
        'ทรงช่วยพ้นบาปทุกเวลา',
        'ข้าต้องการพระเยซูยิ่งกว่าเป็นราชา',
        'ซึ่งโลกนี้มีให้ข้า',
      ],
      [
        //verse 3
        'ข้าต้องการพระเยซู',
        'ยิ่งกว่าความสุขสําราญ',
        'ข้า ม่อยากจะเดิน',
        'ตามโลกียวิสัย',
        'ข้าต้องการพระเยซู',
        'ยิ่งกว่าความเบิกบานใจ',
        'อยากให้พระองค์นําไปเมืองวิไล',
        'พระเยซูเป็นยอดปรารถนาของข้า',
        'ทรงช่วยพ้นบาปทุกเวลา',
        'ข้าต้องการพระเยซูยิ่งกว่าเป็นราชา',
        'ซึ่งโลกนี้มีให้ข้า',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H112() => VideoModel(
    name: 'T112',
    title: '112. ในคืนวันหนึ่งยามเงียบสงัด',
    lyric: [
      [
        //verse 1
        'ในคืนวันหนึ่งยามเงียบสงัด',
        'มีทูตสวรรค์ลงมา',
        'ร้องเพลงสรรเสริญดีดพิณทองคํา',
        'และนําข่าวดีกล่าวว่า',
        'ความสุขจงมีแก่ชาวโลกนี้',
        'เพราะมีกษัตริย์บังเกิด',
        'มนุษย์ทั้งหลายจงเงี่ยหูฟัง',
        'บทเพลงความสุขประเสริฐ',
      ],
      [
        //verse 2
        'เหล่าทูตสวรรค์พากันลงมา',
        'ร้องเพลงแสดงยินดี',
        'เพื่อให้ชาวโลกซึ่งเหน็ดเหนื่อยใจ',
        'ได้รับความสุขเปรมปรีดิ์',
        'แต่ว่ามนุษย์ยังคงดื้อดึง',
        'ไม่มีความสามัคคี',
        'คนบาปทั้งหลายจงไตร่ตรองดู',
        'รับพรจากพระเยซู',
      ],
      [
        //verse 3
        'ผู้ใดเป็นทุกข์หนักอกหนักใจ',
        'ต้องแบกภาระเหลือหลาย',
        'ผู้ใดรับความทุกข์ทรมาน',
        'จนเหนื่อยดูเหมือนไม่ไหว',
        'บัดนี้จงเงยหน้าดูพระเจ้า',
        'รับเอาความรอดโดยดี',
        'พระองค์จะโปรดประทานความสุข',
        'พ้นทุกข์แก่ท่านทันที',
      ],
      [
        //verse 4
        'วันคืนกําลังจะผ่านพ้นไป',
        'ตามคําผู้ทํานายไว้',
        'ยุคนั้นจะมาเวลากําหนด',
        'คือยุคไม่มีความตาย',
        'ความสุขจะแผ่ออกไปทั่วโลก',
        'เปรียบดังแสงรัศมี',
        'ชาวโลกร้องเพลงอย่างทูตสวรรค์',
        'คือเพลงสุขสวัสดี',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H135() => VideoModel(
    name: 'T135',
    title: '135. ไม้กางเขนโบราณ',
    lyric: [
      [
        //verse 1
        'บนภูเขาซึ่งอยู่ไกล ได้แลเห็นไม้กางเขน',
        'เป็นรอยแห่งความทุกข์และความอาย',
        'แต่ใจข้ารักกางเขน ที่พระคริสต์ถูกตรึงตาย',
        'ไถ่คนบาปให้รอดพ้นจากอบาย',
        'โดยเหตุนี้ข้าจึงรักไม้กางเขน',
        'เพราะว่าเป็นที่จะวางภาระลง',
        'ข้าก็คงยึดกางเขนไว้ให้มั่น',
        'แล้ววันหนึ่งจะแลกเอามงกุฎงาม',
      ],
      [
        //verse 2
        'ไม้กางเขนโบราณนั้น ชาวโลกพากันดูหมิ่น',
        'แต่ข้ารักกางเขนยิ่งนักหนา',
        'เพราะพระเยซูคริสต์เจ้า สละเนาในเมืองฟ้า',
        'เสด็จมาเพื่อยอมตายบนกางเขน',
        'โดยเหตุนี้ข้าจึงรักไม้กางเขน',
        'เพราะว่าเป็นที่จะวางภาระลง',
        'ข้าก็คงยึดกางเขนไว้ให้มั่น',
        'แล้ววันหนึ่งจะแลกเอามงกุฎงาม',
      ],
      [
        //verse 3
        'ที่กางเขนโบราณนั้น ข้าได้เห็นรัศมี',
        'พระโลหิตพระองค์ได้หลั่งไหล',
        'เพื่อจะได้ชําระบาป ในตัวข้าให้สะอาด',
        'นั่นแหละคือไม้กางเขนโบราณนั้น',
        'โดยเหตุนี้ข้าจึงรักไม้กางเขน',
        'เพราะว่าเป็นที่จะวางภาระลง',
        'ข้าก็คงยึดกางเขนไว้ให้มั่น',
        'แล้ววันหนึ่งจะแลกเอามงกุฎงาม',
      ],
      [
        //verse 4
        'ไม้กางเขนโบราณนั้น ยึดมั่นไว้จนวันตาย',
        'หากใครติเตียน ข้าไม่ละอาย',
        'เมื่อวันหนึ่งถึงเวลา พระองค์มารับข้าไป',
        'สู่สวรรค์อยู่ที่นั่นสําราญใจ',
        'โดยเหตุนี้ข้าจึงรักไม้กางเขน',
        'เพราะว่าเป็นที่จะวางภาระลง',
        'ข้าก็คงยึดกางเขนไว้ให้มั่น',
        'แล้ววันหนึ่งจะแลกเอามงกุฎงาม',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H138() => VideoModel(
        name: 'T138',
        title: '138. ที่กางเขน ที่กางเขน',
        lyric: [
          [
            //verse 1
            'พระโลหิตของพระเยซูไหล พระองค์ทนทุกข์อับอาย',
            'จนในที่สุดพระองค์ต้องตาย  ก็เพื่อล้างบาปของข้า',
            'ที่กางเขน ที่กางเขน ข้าแลเห็นความสว่าง',
            'และความหนักใจอันใหญ่ยิ่ง ได้หลุดหาย',
            'เพราะข้าดูกางเขน จึงแลเห็นกระจ่าง เดี่ยวนี้ข้าจึงมีความสุขสบาย',
          ],
          [
            //verse 2
            'พระเยซูถูกตรึงที่กางเขน รับบาปรับเวรแทนข้า',
            'พระองค์สําแดงความรักเมตตา ความรักใดไม่เปรียบปาน',
            'ที่กางเขน ที่กางเขน ข้าแลเห็นความสว่าง',
            'และความหนักใจอันใหญ่ยิ่ง ได้หลุดหาย',
            'เพราะข้าดูกางเขน จึงแลเห็นกระจ่าง เดี่ยวนี้ข้าจึงมีความสุขสบาย',
          ],
          [
            //verse 3
            'พระองค์ทนทุกข์มากมายเหลือคิด ตัวข้าเป็นหนี้พระคริสต์',
            'ข้าขอถวายทั้งกายและจิต ไว้ใต้พระบาทพระคริสต์',
            'ที่กางเขน ที่กางเขน ข้าแลเห็นความสว่าง',
            'และความหนักใจอันใหญ่ยิ่ง ได้หลุดหาย',
            'เพราะข้าดูกางเขน จึงแลเห็นกระจ่าง เดี่ยวนี้ข้าจึงมีความสุขสบาย',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H147() => VideoModel(
        name: 'T147',
        title: '147. เมื่อข้าเพ่งดูกางเขนประหลาด',
        lyric: [
          [
            //verse 1
            'เมื่อข้าเพ่งดูกางเขนประหลาด ที่พระเยซูทรงสิ้นชีวา',
            'ทรัพย์สินในโลกข้าไม่สวาท เมื่อเทียบกางเขนประเสริฐนักหนา',
          ],
          [
            //verse 2
            'โปรดอย่าให้ข้าอวดอ้างโลกนี้ ขออวดถึงมรณาพระ คริสต์',
            'สิ่งของในโลกที่ข้าชอบชี้ มอบไว้หมดกับพระผู้พลีชีพ',
          ],
          [
            //verse 3
            'เมื่อดูพระเศียรพระหัตถ์พระบาท ความทุกข์และความรักหลั่งลงมา',
            'ใครเคยทนทุกข์อันน่าอนาถ หรือสวมหนามแทนมงกุฎโสภา',
          ],
          [
            //verse 4
            'แม้เอาสมบัติทั้งสิ้นโลกา น้อยนักถวายองค์พระผู้ไถ่',
            'ความรักพระองค์ประเสริฐนักหนา เรายอมถวายทั้งใจและกาย',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H150() => VideoModel(
        name: 'T150',
        title: '150. พระเยซูทรงเป็นขึ้นแล้ว',
        lyric: [
          [
            //verse 1
            'บรรทมอยู่ในอุโมงค์ พระเยซูของข้า',
            'คอยอยู่จนถึงเวลา เสด็จออกมา',
            'พระเยซูทรงคืนจากตาย ชัยชนะซาตานซึ่งคอยทําลาย',
            'ทรงเป็นผู้มีฤทธิ์เหนืออาณาจักรมารร้าย',
            'ทรงครอบครองอยู่กับผู้บริสุทธิ์ทั้งหลาย',
            'เป็นขึ้นแล้ว เป็นขึ้นแล้ว พระเยซูทรงเป็นขึ้นแล้ว',
          ],
          [
            //verse 2
            'ตีตราอุโมงค์ป่วยการ พระเยซูของข้า',
            'ยามเฝ้าไม่ได้ประโยชน์ พระเยซูเจ้า',
            'พระเยซูทรงคืนจากตาย ชัยชนะซาตานซึ่งคอยทําลาย',
            'ทรงเป็นผู้มีฤทธิ์เหนืออาณาจักรมารร้าย',
            'ทรงครอบครองอยู่กับผู้บริสุทธิ์ทั้งหลาย',
            'เป็นขึ้นแล้ว เป็นขึ้นแล้ว พระเยซูทรงเป็นขึ้นแล้ว',
          ],
          [
            //verse 3
            'ความตายไม่อาจทําลาย พระเยซูของข้า',
            'พระองค์พิชิตความตาย พระเยซูเจ้า',
            'พระเยซูทรงคืนจากตาย ชัยชนะซาตานซึ่งคอยทําลาย',
            'ทรงเป็นผู้มีฤทธิ์เหนืออาณาจักรมารร้าย',
            'ทรงครอบครองอยู่กับผู้บริสุทธิ์ทั้งหลาย',
            'เป็นขึ้นแล้ว เป็นขึ้นแล้ว พระเยซูทรงเป็นขึ้นแล้ว',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H151() => VideoModel(
        name: 'T151',
        title: '151. ผู้เป็น',
        lyric: [
          [
            //verse 1
            'ข้าปฏิบัติพระผู้ช่วย ด้วยทรงพระชนม์เป็นอยู่',
            'ข้ารู้ว่าพระองค์ทรงมี ชีวิตเป็นอยู่เรื่อยไป',
            'ข้าเห็นพระคุณพระเยซู ได้ยินเสียงหนุนนํ้าใจ',
            'เมื่อข้ามีความทุกข์ครั้งใด พระองค์อยู่ใกล้',
            'ผู้เป็น ผู้เป็น คือองค์พระเยซูเจ้า',
            'ทรงเดินและตรัสสถิตกับเราทรงนําทางแคบชีวี',
            'ทรงเป็น ทรงพลี ประทานชีวิตนิรันดร์',
            'ท่านถามว่าข้ารู้ได้อย่างไร ข้ารู้ เพราะอยู่ในใจ',
          ],
          [
            //verse 2
            'แลไปในโลกล้อมรอบข้า พระองค์ทรงคุ้มครองอยู่',
            'แม้ข้าจะเหนื่อยแสนเมื่อยล้า แต่ข้าไม่ยอมท้อถอย',
            'ข้ารู้พระองค์ทรงนําหน้า ตามทางชีวาน้อยใหญ่',
            'พระเยซูจะเสด็จมา ในวันสุดท้าย',
            'ผู้เป็น ผู้เป็น คือองค์พระเยซูเจ้า',
            'ทรงเดินและตรัสสถิตกับเราทรงนําทางแคบชีวี',
            'ทรงเป็น ทรงพลี ประทานชีวิตนิรันดร์',
            'ท่านถามว่าข้ารู้ได้อย่างไร ข้ารู้ เพราะอยู่ในใจ',
          ],
          [
            //verse 3
            'ชื่นใจยินดีโอ้คริสเตียน จงเพียรร้องเพลงสรรเสริญ',
            'สรรเสริญว่าฮาเลลูยา แด่พระเยซูผู้ไถ่',
            'ทรงเป็นความหวังของผู้หา เมตตาแก่คนทั่วไป',
            'ไม่มีใครเหมือนพระเยซู พระผู้ยิ่งใหญ่',
            'ผู้เป็น ผู้เป็น คือองค์พระเยซูเจ้า',
            'ทรงเดินและตรัสสถิตกับเรา ทรงนําทางแคบชีวี',
            'ทรงเป็น ทรงพลี ประทานชีวิตนิรันดร์',
            'ท่านถามว่าข้ารู้ได้อย่างไร ข้ารู้ เพราะอยู่ในใจ',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H158() => VideoModel(
        name: 'T158',
        title: '158. วันหนึ่ง',
        lyric: [
          [
            //verse 1
            'วันหนึ่งเมื่อท้องฟ้าเต็มดัวยสง่าราศี',
            'วันหนึ่งเมื่อควานชั่วมืดมัวร้ายเต็มที',
            'พระเยซูประสูติจากหญิงพรหมจารี',
            'อยู่ท่ามกลางเราเป็นแบบอย่างนําชีวี',
            'พระองค์ทรงรักข้า ทรงตายเพื่อไถ่ข้า',
            'ทรงถูกฝังไว้เพื่อจะยกบาปของข้า',
            'แล้วทรงฟื้นคืนชีวา จึงนับว่าชอบธรรม',
            'วันหนึ่งกลับมาอีก วันสําคัญนักหนา',
          ],
          [
            //verse 2
            'วันหนึ่งเขาได้พาพระองค์ขึ้นภูเขานั้น',
            'วันหนึ่งเขาตรึงพระองค์ไว้ที่กางเขน',
            'ถูกทรมานถูกดูหมิ่นถูกทอดทิ้งไว้',
            'แต่พระผู้ไถ่ทรงยอมรับบาปของเรา',
            'พระองค์ทรงรักข้า ทรงตายเพื่อไถ่ข้า',
            'ทรงถูกฝังไว้เพื่อจะยกบาปของข้า',
            'แล้วทรงฟื้นคืนชีวา จึงนับว่าชอบธรรม',
            'วันหนึ่งกลับมาอีก วันสําคัญนักหนา',
          ],
          [
            //verse 3
            'วันหนึ่งอุโมงค์ไม่สามารถซ่อนพระศพไว้',
            'วันหนึ่งก้อนหินกลิ้งจากปากของอุโมงค์',
            'เพราะพระเยซูทรงคืนชีพชนะความตาย',
            'เดี่ยวนี้เสด็จไปสวรรค์งามวิไล',
            'พระองค์ทรงรักข้า ทรงตายเพื่อไถ่ข้า',
            'ทรงถูกฝังไว้เพื่อจะยกบาปของข้า',
            'แล้วทรงฟื้นคืนชีวา จึงนับว่าชอบธรรม',
            'วันหนึ่งกลับมาอีก วันสําคัญนักหนา',
          ],
          [
            //verse 4
            'วันนั้นเสียงแตรเป่าคราวพระองค์เสด็จมา',
            'วันนั้นท้องฟ้าจะกระจ่างแจ้งสุกใส',
            'วันนั้นพระเยซูจะทรงพาเราขึ้นไป',
            'พระเยซูคริสต์เจ้าพระผู้ช่วยของข้า',
            'พระองค์ทรงรักข้า ทรงตายเพื่อไถ่ข้า',
            'ทรงถูกฝังไว้เพื่อจะยกบาปของข้า',
            'แล้วทรงฟื้นคืนชีวา จึงนับว่าชอบธรรม',
            'วันหนึ่งกลับมาอีก วันสําคัญนักหนา',
            '',
          ],
        ],
        maxPage: 7,
      );

  factory VideoModel.H168() => VideoModel(
    name: 'T168',
    title: '168. ครั้นเรียกชื่อที่เมืองเกษมสุข',
    lyric: [
      [
        //verse 1
        'ครั้นเมื่อเป่าแตรของพระเจ้าเวลาของโลกก็ถึงที่สุด',
        'และพระเยซูกลับมารับเราไปสวรรค์',
        'สานุศิษย์ผู้รอดชีวิตในโลกพระเจ้าทรงรับเป็นบุตร',
        'ครั้นตรวจชื่อเบื้องบนชื่อข้าก็อยู่ที่นั่น',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อเบื้องบนชื่อข้าก็อยู่ที่นั่น',
      ],
      [
        //verse 2
        'เวลานั้นศิษย์ของพระองค์ผู้ตายไปแล้วจะคืนชีวี',
        'และจะเข้าในรัศมีบนเมืองสวรรค์',
        'คนเหล่านั้นที่ทรงเลือกสรรในเมืองสวรรค์จะมีราศี',
        'ครั้นตรวจชื่อเบื้องบนชื่อข้าก็อยู่ที่นั่น',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อเบื้องบนชื่อข้าก็อยู่ที่นั่น',
      ],
      [
        //verse 3
        'ให้เร่งทําการของพระเยซูตั้งแต่เวลาเช้าจนคํ่า',
        'และกล่าวถึงความรักพระองค์จนสิ้นชีวัน',
        'เมื่อสําเร็จงานของพระคริสต์ในโลกทั้งสิ้นที่เราควรทํา',
        'ครั้นตรวจชื่อเบื้องบนชื่อข้าก็อยู่ที่นั่น',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อที่เมืองเกษมสุข',
        'ครั้นเรียกชื่อเบื้องบนชื่อข้าก็อยู่ที่นั่น',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H179() => VideoModel(
    name: 'T179',
    title: '179. พระผู้เล้าโลมลงมา',
    lyric: [
      [
        //verse 1
        'แพร่ข่าวแห่งความรอดไป',
        'ไม่ว่ามีคนที่ไหน',
        'ทุกแห่งที่มีดวงใจ',
        'วิบากห้อมล้อมเขาไว้',
        'จงให้คริสเตียนทั้งหลาย',
        'ประกาศด้วยความชื่นใจ',
        'พระผู้เล้าโลมลงมา',
        'พระผู้เล้าโลมลงมา',
        'พระผู้เล้าโลมลงมา',
        'พระวิญญาณเสด็จมา',
        'สัญญาของพระบิดา',
        'ให้หญิงชายประกาศนา',
        'พระวิญญาณทรงนําพา',
        'พระผู้เล้าโลมลงมา',
      ],
      [
        //verse 2
        'ดูเถิดกษัตริย์ยิ่งใหญ่',
        'มีฤทธิ์รักษาให้หาย',
        'วิญญาณที่ถูกขังไว้',
        'ทรงปล่อยให้เขาเป็นไทย',
        'ทุกแดนที่ในคุกใหญ่',
        'เสียงเพลงชนะก้องไป',
        'พระผู้เล้าโลมลงมา',
        'พระผู้เล้าโลมลงมา',
        'พระผู้เล้าโลมลงมา',
        'พระวิญญาณเสด็จมา',
        'สัญญาของพระบิดา',
        'ให้หญิงชายประกาศนา',
        'พระวิญญาณทรงนําพา',
        'พระผู้เล้าโลมลงมา',
      ],
      [
        //verse 3
        'ความรักพระเจ้ายิ่งใหญ่',
        'ลิ้นข้าหมดสามารถไซร้',
        'ประกาศข่าวนี้อย่างไร',
        'เป็นคุณซ้อนคุณมากมาย',
        'แก่ข้าผู้มีบาปหนา',
        'ส่องแสงตามพระฉายา',
        'พระผู้เล้าโลมลงมา',
        'พระผู้เล้าโลมลงมา',
        'พระผู้เล้าโลมลงมา',
        'พระวิญญาณเสด็จมา',
        'สัญญาของพระบิดา',
        'ให้หญิงชายประกาศนา',
        'พระวิญญาณทรงนําพา',
        'พระผู้เล้าโลมลงมา',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H183() => VideoModel(
    name: 'T183',
    title: '183. ตั้งแต่ข้าถูกไถ่ไว้',
    lyric: [
      [
        //verse 1
        'มีเพลงที่ข้าชอบร้องชื่นใจ',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'เป็นเรื่องกษัตริย์องค์พระผู้ไถ่',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนาม',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนามพระผู้ช่วย',
      ],
      [
        //verse 2
        'ข้ามีพระคริสต์ผู้ให้ชื่นใจ',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ชอบทําแต่สิ่งตามนํ้าพระทัย',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนาม',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนามพระผู้ช่วย',
      ],
      [
        //verse 3
        'ข้ามีพยานแจ้งในจิตใจ',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ความกลัวและความสงสัยหายไป',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนาม',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนามพระผู้ช่วย',
      ],
      [
        //verse 4
        'สถานที่พระเจ้าทรงเตรียมไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ที่ข้าจะอยู่เป็นนิจสืบไป',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนาม',
        'ตั้งแต่ข้าถูกไถ่ไว้',
        'ข้าจะสรรเสริญพระนามพระผู้ช่วย',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H184() => VideoModel(
    name: 'T184',
    title: '184. มีแต่พระโลหิตพระเยซู',
    lyric: [
      [
        //verse 1
        'มีอะไรล้างบาปข้าได้',
        'มีแต่พระโลหิตพระเยซู',
        'มีอะไรช่วยพ้นบาปได้',
        'มีแต่พระโลหิตพระเยซู',
        'โลหิตพระคริสต์ประเสริฐ',
        'ซึ่งทําให้ใจขาวเลิศ',
        'ไม่มีอะไรเชื่อเถิด',
        'มีแต่พระโลหิตพระเยซู',
      ],
      [
        //verse 2
        'มีสิ่งเดียวล้างบาปข้าได้',
        'สิ่งนั้นคือโลหิตพระเยซู',
        'ขอพระองค์ทรงยกโทษให้',
        'ยกโทษด้วยโลหิตพระเยซู',
        'โลหิตพระคริสต์ประเสริฐ',
        'ซึ่งทําให้ใจขาวเลิศ',
        'ไม่มีอะไรเชื่อเถิด',
        'มีแต่พระโลหิตพระเยซู',
      ],
      [
        //verse 3
        'ไม่มีทางอื่นล้างบาปได้',
        'มีแต่พระโลหิตพระเยซู',
        'คุณความดีก็ช่วยไม่ได้',
        'มีแต่พระโลหิตพระเยซู',
        'โลหิตพระคริสต์ประเสริฐ',
        'ซึ่งทําให้ใจขาวเลิศ',
        'ไม่มีอะไรเชื่อเถิด',
        'มีแต่พระโลหิตพระเยซู',
      ],
      [
        //verse 4
        'มีความหวังและสันติภาพ',
        'เนื่องจากพระโลหิตพระเยซู',
        'เป็นคนชอบธรรมไม่มีบาป',
        'ก็เพราะพระโลหิตพระเยซู',
        'โลหิตพระคริสต์ประเสริฐ',
        'ซึ่งทําให้ใจขาวเลิศ',
        'ไม่มีอะไรเชื่อเถิด',
        'มีแต่พระโลหิตพระเยซู',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H185() => VideoModel(
    name: 'T185',
    title: '185. เราสู้ยอมตายเพื่อท่าน',
    lyric: [
      [
        //verse 1
        'เราสู้ยอมตายเพื่อท่านโลหิตประเสริฐหลั่งไหล',
        'เพื่อล้างชําระวิญญาณไถ่โทษให้เกิดใจใหม่',
        'เราพลีชีวิตไม่คิดเสียดาย',
        'ท่านมีสิ่งใดถวาย',
        'เราพลีชีวิตไม่คิดเสียดาย',
        'ท่านมีสิ่งใดถวาย',
      ],
      [
        //verse 2
        'ปราสาทแห่งพระบิดาบัลลังก์รุ่งเรืองของเรา',
        'สู้ทิ้งมาสู่โลการับทุกข์ลําบากเปลี่ยวเปล่า',
        'เราทิ้งยศศักดิ์ทั้งหมดศูนย์เปล่า',
        'ท่านทิ้งอะไรเพื่อเรา',
        'เราทิ้งยศศักดิ์ทั้งหมดศูนย์เปล่า',
        'ท่านทิ้งอะไรเพื่อเรา',
      ],
      [
        //verse 3
        'เราสู้ทนทุกข์แรงร้ายเหลือที่จะพรรณนา',
        'ทนความราวีจนตายให้ท่านรอดภัยนานา',
        'เพื่อท่านเราทนความอายเหลือกล่าว',
        'ท่านทิ้งอะไรเพื่อเรา',
        'เพื่อท่านเราทนความอายเหลือกล่าว',
        'ท่านทิ้งอะไรเพื่อเรา',
      ],
      [
        //verse 4
        'เรานําของดีลงมาจากเมืองสวรรค์เบื้องบน',
        'เรานําความรักความรอดและการยกโทษโปรดชน',
        'เรานําของดีมายื่นแจกจ่าย',
        'ท่านยื่นสิ่งใดถวาย',
        'เรานําของดีมายื่นแจกจ่าย',
        'ท่านยื่นสิ่งใดถวาย',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H186() => VideoModel(
    name: 'T186',
    title: '186. ได้ยินเสียงของพระเจ้า',
    lyric: [
      [
        //verse 1
        'ได้ยินเสียงของพระเจ้า',
        'เรียกข้าให้มาเข้าเฝ้า',
        'พระองค์ชําระความบาปหมดเวร',
        'ด้วยโลหิตจากกางเขน',
        'ขอพระองค์เมตตา',
        'ข้ามาเฝ้าเดี่ยวนี้',
        'ขอพระโลหิตจากกางเขน',
        'ล้างบาปให้สิ้นกรรมเวร',
      ],
      [
        //verse 2
        'แม้ข้าเหน็ดเหนื่อยเพราะบาป',
        'พระองค์ประทานเรี่ยวเเรง',
        'มาตรเเม้นชั่วช้าเลวทรามปานใด',
        'โปรดให้สะอาดผ่องใส',
        'ขอพระองค์เมตตา',
        'ข้ามาเฝ้าเดี่ยวนี้',
        'ขอพระโลหิตจากกางเขน',
        'ล้างบาปให้สิ้นกรรมเวร',
      ],
      [
        //verse 3
        'พระองค์สัญญาเเน่นอน',
        'เเก่ผู้จงรักภักดี',
        'มารร้ายไม่อาจจะมายํ่ายี',
        'เพราะว่าพระองค์คุ้มครอง',
        'ขอพระองค์เมตตา',
        'ข้ามาเฝ้าเดี่ยวนี้',
        'ขอพระโลหิตจากกางเขน',
        'ล้างบาปให้สิ้นกรรมเวร',
      ],
      [
        //verse 4
        'ไชโย โลหิตประเสริฐ',
        'ไชโย ความรักลํ้าเลิศ',
        'ไชโย ความรอดขององค์พระคริสต์',
        'เป็นฤทธิ์เเละความสัจจา',
        'ขอพระองค์เมตตา',
        'ข้ามาเฝ้าเดี่ยวนี้',
        'ขอพระโลหิตจากกางเขน',
        'ล้างบาปให้สิ้นกรรมเวร',
        '',
      ],
    ],
    maxPage: 7,
  );

  factory VideoModel.H499() => VideoModel(
        name: 'T499',
        title: '499. ข้าเดินอยู่ในสวน',
        lyric: [
          [
            //verse 1
            'ข้าเดินอยู่ในสวนเพียงลำพัง',
            'น้ำค้างยังหยดค้างบนดอกไม้งาม',
            'ข้าได้ยินเสียงตรัสพระดำรัสพระองค์',
            'พระบุตรพระเจ้าสำแดงแก่ข้า',
            'ทรงดำเนินกับข้าและทรงตรัสกับข้า',
            'ทรงตรัสว่าข้าเป็นของพระองค์',
            'ความสุขใจที่มีเมื่ออยู่เคียงพระองค์',
            'ใครจะรู้ไม่มีใครเลย',
          ],
          [
            //verse 2
            'พระองค์ตรัสด้วยสำเนียงอ่อนหวาน',
            'ไพเราะปานเหล่านกพากันร้องเพลง',
            'ท่วงทำนองบรรเลงประทานเพลงแก่ข้า',
            'มีเสียงบรรเลงขึ้นในใจข้า',
            'ทรงดำเนินกับข้าและทรงตรัสกับข้า',
            'ทรงตรัสว่าข้าเป็นของพระองค์',
            'ความสุขใจที่มีเมื่ออยู่เคียงพระองค์',
            'ใครจะรู้ไม่มีใครเลย',
          ],
          [
            //verse 3
            'ข้าได้อยู่ในสวนกับพระองค์',
            'แม้ค่ำคืนมืดมิดจะโอบล้อมอยู่',
            'แต่ทรงชูใจข้าด้วยพระทัยเมตตา',
            'พระสุระเสียงทรงเรียกตัวข้า',
            'ทรงดำเนินกับข้าและทรงตรัสกับข้า',
            'ทรงตรัสว่าข้าเป็นของพระองค์',
            'ความสุขใจที่มีเมื่ออยู่เคียงพระองค์',
            'ใครจะรู้ไม่มีใครเลย',
            '',
          ],
        ],
        maxPage: 7,
      );
}
